# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [3]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [7]:
# your code her
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [49]:
# your code here
print(temp)
display(temp)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [10]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [11]:
"""
We have categorical data (City and State) and numerical data (Temperature)

"""

'\nWe have categorical data (City and State) and numerical data (Temperature)\n\n'

#### Select the rows where state is New York.

In [39]:
# your code here
temp_ny = temp[temp['State'] == 'New York']
display(temp_ny)

# grouped = temp.groupby('State')
# new_york_data = grouped.get_group('New York')
# display(new_york_data)

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [47]:
# your code here
ny_mean = temp_ny['Temperature'].mean()
print("The average temperature of cities in New York is", ny_mean)

The average temperature of cities in New York is 10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [62]:
# your code here
high_temp = temp[temp['Temperature'] > 15]
states_cities_high_temp = high_temp[['State', 'City']]
states_cities_high_temp

         State      City
0     New York       NYC
3  Connecticut  Hartford
5   New Jersey    Treton
6   New Jersey    Newark

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [72]:
# your code here
cities_high_temp = high_temp['City']
cities_high_temp

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [73]:
# your code here
condition = (temp['Temperature'] > 15) & (temp['Temperature'] < 20)
cities_between_15_and_20 = temp[condition]['City']

print(cities_between_15_and_20)

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [74]:
# your code here
state_stats = temp.groupby('State')['Temperature'].agg(['mean', 'std'])

state_stats.reset_index(inplace=True)

print(state_stats)

         State       mean       std
0  Connecticut  15.833333  1.964186
1   New Jersey  21.111111  1.571348
2     New York  10.740741  8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [94]:
# your code here
employees = pd.read_csv('Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [91]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [87]:
"""
We have categorical data and numerical data
"""

'\nWe have categorical data and numerical data\n'

#### What's the average salary in this company?

In [92]:
# your code here
avg_salary = employees['Salary'].mean()

print('The average salary in this company is',avg_salary)

The average salary in this company is 48.888888888888886

#### What's the highest salary?

In [96]:
# your code here
highest_salary = employees['Salary'].max()
print('The highest salary in this company is',highest_salary)

The highest salary in this company is 70

#### What's the lowest salary?

In [98]:
# your code here
lowest_salary = employees['Salary'].min()
print('The lowest salary in this company is',lowest_salary)

The lowest salary in this company is 30

#### Who are the employees with the lowest salary?

In [106]:
# your code here
lowest_salary_employees = employees[employees['Salary'] == lowest_salary]

# Select only the 'Name' column
names_of_lowest_salary_employees = lowest_salary_employees['Name']

print('The employees with the lowest salary are:')
print(names_of_lowest_salary_employees)

The employees with the lowest salary are:
1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [117]:
# your code here

# employees_info_David = employees[employees['Name'] == 'David']

# employees_info_David

def employee_info_by_name(dataframe, name):
    employee_info = dataframe[dataframe['Name'] == name]
    return employee_info

employee_name = 'David'
employee_info = employee_info_by_name(employees, employee_name)
print(employee_info)

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [118]:
# your code here

employee_name = 'David'

david_info = employees[employees['Name'] == employee_name]
david_salary = david_info['Salary'].values[0]
print(f"{employee_name}'s salary is: {david_salary}")

David's salary is: 30

#### Print all the rows where job title is associate.

In [122]:
# your code here
associate_employees = employees[employees['Title'] == 'associate']
associate_employees

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [123]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [124]:
# Method 2
# your code here
employees[0:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [130]:
# your code here

# associate_above_55 = employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

associate_above_55 = associate_employees[associate_employees['Salary'] > 55]

print(associate_above_55)

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [132]:
# your code here
average_salaries_by_years = employees.groupby('Years')['Salary'].mean()
# average_salaries_by_years = employees.groupby('Years').agg({'Salary': 'mean'})

average_salaries_by_years = average_salaries_by_years.reset_index()

average_salaries_by_years.columns = ['Years', 'Average Salary']

print(average_salaries_by_years)

   Years  Average Salary
0      1       35.000000
1      2       38.333333
2      3       55.000000
3      4       35.000000
4      7       60.000000
5      8       70.000000

####  What is the average salary per title?

In [136]:
# your code here
avg_salary_per_title = employees.groupby('Title')['Salary'].mean()
avg_salary_per_title = avg_salary_per_title.reset_index()

avg_salary_per_title.columns = ['Title', 'Averege Salary']
avg_salary_per_title

       Title  Averege Salary
0         VP       70.000000
1    analyst       32.500000
2  associate       56.666667

####  Find the salary quartiles.

In [139]:
# your code here
salary_quartiles = employees['Salary'].quantile([0, 0.25, 0.5, 0.75, 1])

print("Salary Quartiles:")
print(salary_quartiles)

Salary Quartiles:
0.00    30.0
0.25    35.0
0.50    55.0
0.75    60.0
1.00    70.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [156]:
# your code here
mean_salary_by_gender = employees.groupby('Gender')['Salary'].mean()

print(mean_salary_by_gender)
print('\n')

# Calculate the mean salary for males
mean_salary_male = employees[employees['Gender'] == 'M']['Salary'].mean()

# Calculate the mean salary for females
mean_salary_female = employees[employees['Gender'] == 'F']['Salary'].mean()

if mean_salary_male == mean_salary_female:
    print("Mean salaries for gender are the same.")
else:
    print("Mean salaries for gender are different.")

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64


Mean salaries for gender are different.

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [158]:
# your code here

# Group the employees by the 'Department' column
grouped_by_department = employees.groupby('Department')

# Calculate the minimum, mean, and maximum for each numeric column within each department
department_statistics = grouped_by_department.agg({
    'Salary': ['min', 'mean', 'max'],
    'Years': ['min', 'mean', 'max']
})

print(department_statistics)

           Salary            Years
              min   mean max   min      mean max
Department
HR             30  45.00  70     2  4.666667   8
IT             30  48.75  70     1  4.500000   8
Sales          55  55.00  55     2  2.500000   3

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [162]:
# your code here

grouped_by_department = employees.groupby('Department')

# Define a custom function to calculate the salary range (max - min)
salary_range = lambda x: x.max() - x.min()

department_salary_range = grouped_by_department['Salary'].agg(salary_range)

print(department_salary_range)

Department
HR       40
IT       40
Sales     0
Name: Salary, dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [164]:
# your code here
orders = pd.read_csv('Orders/Orders.csv')
orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [169]:
# your code here
print(orders.dtypes)
orders.shape
orders.info()

Unnamed: 0        int64
InvoiceNo         int64
StockCode        object
year              int64
month             int64
day               int64
hour              int64
Description      object
Quantity          int64
InvoiceDate      object
UnitPrice       float64
CustomerID        int64
Country          object
amount_spent    float64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397924 entries, 0 to 397923
Data columns (total 14 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   Unnamed: 0    397924 non-null  int64
 1   InvoiceNo     397924 non-null  int64
 2   StockCode     397924 non-null  object
 3   year          397924 non-null  int64
 4   month         397924 non-null  int64
 5   day           397924 non-null  int64
 6   hour          397924 non-null  int64
 7   Description   397924 non-null  object
 8   Quantity      397924 non-null  int64
 9   InvoiceDate   397924 non-null  object
 10  UnitPrice     397924 non-null  float64
 11  CustomerID    397924 non-null  int64
 12  Country       397924 non-null  object
 13  amount_spent  397924 non-null  float64
dtypes: float64(2), int64(8), object(4)
memory usage: 42.5+ MB

In [ ]:
"""
We have categorical data and numerical data with 397924 rows and 14 columns and theres no NaN on it.

"""

####  What is the average purchase price?

In [171]:
# your code here
average_purchase_price = orders['UnitPrice'].mean()

print("Average Purchase Price:", average_purchase_price)

Average Purchase Price: 3.1161744805540756

#### What are the highest and lowest purchase prices?

In [175]:
# your code here
max_purchase_price = orders['UnitPrice'].max()
min_purchase_price = orders['UnitPrice'].min()
print(max_purchase_price)
print(min_purchase_price)

8142.75
0.0

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [178]:
# your code here
customers_from_spain = orders[orders['Country'] == 'Spain']
unique_spanish_customers = customers_from_spain['CustomerID'].unique()
unique_spanish_customers

array([12557, 17097, 12540, 12551, 12484, 12539, 12510, 12421, 12502,
       12462, 12507, 12541, 12547, 12597, 12545, 12596, 12354, 12417,
       12455, 12450, 12548, 12556, 12550, 12546, 12454, 12448, 12544,
       12538, 12445, 12442], dtype=int64)

#### How many customers do we have in Spain?

In [185]:
# your code here
total_spanish_customers = len(unique_spanish_customers)
total_spanish_customers

30

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [190]:
# your code here
customer_total_quantity = orders.groupby('CustomerID')['Quantity'].sum()

# Filter for customers with a total quantity greater than 50
customers_with_more_than_50_items = customer_total_quantity[customer_total_quantity > 50]
customers_with_more_than_50_items = customers_with_more_than_50_items.reset_index()

customers_with_more_than_50_items.columns = ['CustomerID','Quantity of items bought']

print(customers_with_more_than_50_items)

      CustomerID  Quantity of items bought
0          12346                     74215
1          12347                      2458
2          12348                      2341
3          12349                       631
4          12350                       197
...          ...                       ...
4086       18278                        66
4087       18281                        54
4088       18282                       103
4089       18283                      1397
4090       18287                      1586

[4091 rows x 2 columns]

#### Select orders from Spain that include more than 50 items.

In [197]:
# your code here
orders_from_Spain = orders[orders['Country'] == 'Spain']
orders_more_than_50_items = orders_from_Spain[orders_from_Spain['Quantity'] > 50]

print("Orders from Spain with more than 50 items:")
print(orders_more_than_50_items)

Orders from Spain with more than 50 items:
        Unnamed: 0  InvoiceNo StockCode  year  month  day  hour  \
4250          6421     536944     22383  2010     12    5    12
4251          6422     536944     22384  2010     12    5    12
4252          6423     536944     20727  2010     12    5    12
4253          6424     536944     20725  2010     12    5    12
4254          6425     536944     20728  2010     12    5    12
32454        52416     540785    84997B  2011      1    2    11
32455        52417     540785    84997D  2011      1    2    11
32456        52418     540785    84997C  2011      1    2    11
32457        52419     540785    84997A  2011      1    2    11
91155       136767     547972     22383  2011      3    1    16
91156       136768     547972     22384  2011      3    1    16
91159       136771     547972     20728  2011      3    1    16
174442      248797     558871     22384  2011      7    1    13
174443      248798     558871     20727  2011      7    1    13
174444      248799     558871     20725  2011      7    1    13
174445      248800     558871     20728  2011      7    1    13
174446      248801     558871    84997B  2011      7    1    13
174447      248802     558871    84997D  2011      7    1    13
174448      248803     558871    84997C  2011      7    1    13
174449      248804     558871    84997A  2011      7    1    13
197167      282906     561669     23295  2011      7    4    17
197168      282907     561669     23297  2011      7    4    17
197169      282908     561669     23294  2011      7    4    17
197170      282909     561669     23296  2011      7    4    17
197171      282910     561669     23293  2011      7    4    17
224881      315702     564734     84826  2011      8    7    13
254097      355752     567968     85204  2011      9    5     9
289129      398626     571255    82494L  2011     10    5    17
289134      398631     571255     82482  2011     10    5    17
289142      398639     571255    72802B  2011     10    5    17
289143      398640     571255    72802C  2011     10    5    17
295956      407272     571851     23167  2011     10    3    13
312655      426665     573362     22598  2011     10    7    13
312656      426666     573362     22597  2011     10    7    13
312657      426667     573362     22599  2011     10    7    13
366326      495739     578321     20728  2011     11    3    16
366327      495740     578321    84997B  2011     11    3    16
366328      495741     578321    84997D  2011     11    3    16
366329      495742     578321    84997C  2011     11    3    16

                                Description  Quantity          InvoiceDate  \
4250                lunch bag suki  design         70  2010-12-03 12:20:00
4251                lunch bag pink polkadot       100  2010-12-03 12:20:00
4252                lunch bag  black skull.        60  2010-12-03 12:20:00
4253                lunch bag red retrospot        70  2010-12-03 12:20:00
4254                    lunch bag cars blue       100  2010-12-03 12:20:00
32454     red 3 piece retrospot cutlery set       144  2011-01-11 11:39:00
32455     pink 3 piece polkadot cutlery set       360  2011-01-11 11:39:00
32456     blue 3 piece polkadot cutlery set       360  2011-01-11 11:39:00
32457    green 3 piece polkadot cutlery set       144  2011-01-11 11:39:00
91155                lunch bag suki design        150  2011-03-28 16:41:00
91156               lunch bag pink polkadot       150  2011-03-28 16:41:00
91159                   lunch bag cars blue       150  2011-03-28 16:41:00
174442              lunch bag pink polkadot       100  2011-07-04 13:19:00
174443              lunch bag  black skull.       100  2011-07-04 13:19:00
174444              lunch bag red retrospot       100  2011-07-04 13:19:00
174445                  lunch bag cars blue       100  2011-07-04 13:19:00
174446     childrens cutlery retrospot red         72  2011-07-04 13:19:00
174447      childrens cutlery polkadot pink       360  2011-07-04 13:19:00
174448      childrens cutlery polkadot blue       360  2011-07-04 13:19:00
174449    childrens cutlery polkadot green         72  2011-07-04 13:19:00
197167     set of 12 mini loaf baking cases       128  2011-07-28 17:09:00
197168  set 40 heart shape petit four cases       144  2011-07-28 17:09:00
197169     set of 6 snack loaf baking cases       128  2011-07-28 17:09:00
197170       set of 6 tea time baking cases       128  2011-07-28 17:09:00
197171    set of 12 fairy cake baking cases       128  2011-07-28 17:09:00
224881       asstd design 3d paper stickers        60  2011-08-28 13:32:00
254097         hanging wood and felt flower        96  2011-09-23 09:44:00
289129          wooden frame antique white         72  2011-10-14 17:13:00
289134    wooden picture frame white finish        72  2011-10-14 17:13:00
289142   ocean scent candle in jewelled box       200  2011-10-14 17:13:00
289143    vanilla scent candle jewelled box       288  2011-10-14 17:13:00
295956       small ceramic top storage jar         96  2011-10-19 13:02:00
312655          christmas musical zinc tree        72  2011-10-30 13:06:00
312656       musical zinc heart decoration         72  2011-10-30 13:06:00
312657          christmas musical zinc star        72  2011-10-30 13:06:00
366326                  lunch bag cars blue       200  2011-11-23 16:59:00
366327     childrens cutlery retrospot red         72  2011-11-23 16:59:00
366328      childrens cutlery polkadot pink       360  2011-11-23 16:59:00
366329      childrens cutlery polkadot blue       288  2011-11-23 16:59:00

        UnitPrice  CustomerID Country  amount_spent
4250         1.65       12557   Spain        115.50
4251         1.45       12557   Spain        145.00
4252         1.65       12557   Spain         99.00
4253         1.65       12557   Spain        115.50
4254         1.45       12557   Spain        145.00
32454        3.39       12557   Spain        488.16
32455        3.39       12557   Spain       1220.40
32456        3.39       12557   Spain       1220.40
32457        3.39       12557   Spain        488.16
91155        1.45       12557   Spain        217.50
91156        1.45       12557   Spain        217.50
91159        1.45       12557   Spain        217.50
174442       1.45       12557   Spain        145.00
174443       1.45       12557   Spain        145.00
174444       1.45       12557   Spain        145.00
174445       1.45       12557   Spain        145.00
174446       3.75       12557   Spain        270.00
174447       3.75       12557   Spain       1350.00
174448       3.75       12557   Spain       1350.00
174449       3.75       12557   Spain        270.00
197167       0.72       12507   Spain         92.16
197168       1.45       12507   Spain        208.80
197169       0.72       12507   Spain         92.16
197170       1.04       12507   Spain        133.12
197171       0.72       12507   Spain         92.16
224881       0.85       12484   Spain         51.00
254097       0.12       12546   Spain         11.52
289129       2.55       12454   Spain        183.60
289134       2.55       12454   Spain        183.60
289142       1.25       12454   Spain        250.00
289143       1.25       12454   Spain        360.00
295956       0.69       12596   Spain         66.24
312655       0.29       12597   Spain         20.88
312656       0.29       12597   Spain         20.88
312657       0.29       12597   Spain         20.88
366326       1.45       12557   Spain        290.00
366327       3.75       12557   Spain        270.00
366328       3.75       12557   Spain       1350.00
366329       3.75       12557   Spain       1080.00

#### Select all free orders.

In [199]:
# your code here
free_orders = orders[orders['UnitPrice'] == 0]

print(free_orders)

        Unnamed: 0  InvoiceNo StockCode  year  month  day  hour  \
6914          9302     537197     22841  2010     12    7    14
22539        33576     539263     22580  2010     12    4    14
25379        40089     539722     22423  2010     12    2    13
29080        47068     540372     22090  2011      1    4    16
29082        47070     540372     22553  2011      1    4    16
34494        56674     541109     22168  2011      1    4    15
53788        86789     543599    84535B  2011      2    4    13
85671       130188     547417     22062  2011      3    3    10
92875       139453     548318     22055  2011      3    3    12
97430       145208     548871     22162  2011      4    1    14
107192      157042     550188     22636  2011      4    4    18
128641      187613     553000     47566  2011      5    4    15
137127      198383     554037     22619  2011      5    5    14
194648      279324     561284     22167  2011      7    2    12
197173      282912     561669     22960  2011      7    4    17
199711      285657     561916         M  2011      8    1    11
208950      298054     562973     23157  2011      8    4    11
223931      314745     564651     23270  2011      8    5    14
223932      314746     564651     23268  2011      8    5    14
223933      314747     564651     22955  2011      8    5    14
223934      314748     564651     21786  2011      8    5    14
256263      358655     568158      PADS  2011      9    7    12
259399      361825     568384         M  2011      9    2     9
273926      379913     569716     22778  2011     10    4     8
286507      395529     571035         M  2011     10    4    12
307092      420404     572893     21208  2011     10    3    14
319882      436428     574138     23234  2011     11    4    11
320049      436597     574175     22065  2011     11    4    11
320407      436961     574252         M  2011     11    4    13
322279      439361     574469     22385  2011     11    5    11
328385      446125     574879     22625  2011     11    1    13
329006      446793     574920     22899  2011     11    1    16
329007      446794     574920     23480  2011     11    1    16
334242      454463     575579     22437  2011     11    4    11
334243      454464     575579     22089  2011     11    4    11
352746      479079     577129     22464  2011     11    4    19
353097      479546     577168         M  2011     11    5    10
354170      480649     577314     23407  2011     11    5    13
358629      485985     577696         M  2011     11    1    11
370473      502122     578841     84826  2011     11    5    15

                                Description  Quantity          InvoiceDate  \
6914           round cake tin vintage green         1  2010-12-05 14:02:00
22539          advent calendar gingham sack         4  2010-12-16 14:36:00
25379              regency cakestand 3 tier        10  2010-12-21 13:45:00
29080               paper bunting retrospot        24  2011-01-06 16:41:00
29082                plasters in tin skulls        24  2011-01-06 16:41:00
34494         organiser wood antique white          1  2011-01-13 15:10:00
53788          fairy cakes notebook a6 size        16  2011-02-10 13:08:00
85671   ceramic bowl with love heart design        36  2011-03-23 10:25:00
92875    mini cake stand  hanging strawbery         5  2011-03-30 12:45:00
97430           heart garland rustic padded         2  2011-04-04 14:42:00
107192   childs breakfast set circus parade         1  2011-04-14 18:57:00
128641                        party bunting         4  2011-05-12 15:21:00
137127            set of 6 soldier skittles        80  2011-05-20 14:13:00
194648           oval wall mirror diamante          1  2011-07-26 12:24:00
197173             jam making set with jars        11  2011-07-28 17:09:00
199711                               manual         1  2011-08-01 11:44:00
208950           set of 6 nativity magnets        240  2011-08-11 11:42:00
223931     set of 2 ceramic painted hearts         96  2011-08-26 14:19:00
223932  set of 2 ceramic christmas reindeer       192  2011-08-26 14:19:00
223933             36 foil star cake cases        144  2011-08-26 14:19:00
223934                   polkadot rain hat        144  2011-08-26 14:19:00
256263           pads to match all cushions         1  2011-09-25 12:22:00
259399                               manual         1  2011-09-27 09:46:00
273926                   glass cloche small         2  2011-10-06 08:17:00
286507                               manual         1  2011-10-13 12:50:00
307092          pastel colour honeycomb fan         5  2011-10-26 14:36:00
319882        biscuit tin vintage christmas       216  2011-11-03 11:26:00
320049       christmas pudding trinket pot         12  2011-11-03 11:47:00
320407                               manual         1  2011-11-03 13:24:00
322279            jumbo bag spaceboy design        12  2011-11-04 11:55:00
328385                   red kitchen scales         2  2011-11-07 13:22:00
329006         children's apron dolly girl          1  2011-11-07 16:34:00
329007       mini lights woodland mushrooms         1  2011-11-07 16:34:00
334242        set of 9 black skull balloons        20  2011-11-10 11:49:00
334243        paper bunting vintage paisley        24  2011-11-10 11:49:00
352746          hanging metal heart lantern         4  2011-11-17 19:52:00
353097                               manual         1  2011-11-18 10:42:00
354170       set of 2 trays home sweet home         2  2011-11-18 13:23:00
358629                               manual         1  2011-11-21 11:57:00
370473       asstd design 3d paper stickers     12540  2011-11-25 15:57:00

        UnitPrice  CustomerID         Country  amount_spent
6914          0.0       12647         Germany           0.0
22539         0.0       16560  United Kingdom           0.0
25379         0.0       14911            EIRE           0.0
29080         0.0       13081  United Kingdom           0.0
29082         0.0       13081  United Kingdom           0.0
34494         0.0       15107  United Kingdom           0.0
53788         0.0       17560  United Kingdom           0.0
85671         0.0       13239  United Kingdom           0.0
92875         0.0       13113  United Kingdom           0.0
97430         0.0       14410  United Kingdom           0.0
107192        0.0       12457     Switzerland           0.0
128641        0.0       17667  United Kingdom           0.0
137127        0.0       12415       Australia           0.0
194648        0.0       16818  United Kingdom           0.0
197173        0.0       12507           Spain           0.0
199711        0.0       15581  United Kingdom           0.0
208950        0.0       14911            EIRE           0.0
223931        0.0       14646     Netherlands           0.0
223932        0.0       14646     Netherlands           0.0
223933        0.0       14646     Netherlands           0.0
223934        0.0       14646     Netherlands           0.0
256263        0.0       16133  United Kingdom           0.0
259399        0.0       12748  United Kingdom           0.0
273926        0.0       15804  United Kingdom           0.0
286507        0.0       12446             RSA           0.0
307092        0.0       18059  United Kingdom           0.0
319882        0.0       12415       Australia           0.0
320049        0.0       14110  United Kingdom           0.0
320407        0.0       12437          France           0.0
322279        0.0       12431       Australia           0.0
328385        0.0       13014  United Kingdom           0.0
329006        0.0       13985  United Kingdom           0.0
329007        0.0       13985  United Kingdom           0.0
334242        0.0       13081  United Kingdom           0.0
334243        0.0       13081  United Kingdom           0.0
352746        0.0       15602  United Kingdom           0.0
353097        0.0       12603         Germany           0.0
354170        0.0       12444          Norway           0.0
358629        0.0       16406  United Kingdom           0.0
370473        0.0       13256  United Kingdom           0.0

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [203]:
# your code here

lunch_bag_orders = orders[orders['Description'].str.startswith('lunch bag')]
lunch_bag_orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
93,93,536378,20725,2010,12,3,9,lunch bag red retrospot,10,2010-12-01 09:37:00,1.65,14688,United Kingdom,16.50
172,174,536385,22662,2010,12,3,9,lunch bag dolly girl design,10,2010-12-01 09:56:00,1.65,17420,United Kingdom,16.50
354,363,536401,22662,2010,12,3,11,lunch bag dolly girl design,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
359,368,536401,20725,2010,12,3,11,lunch bag red retrospot,1,2010-12-01 11:21:00,1.65,15862,United Kingdom,1.65
360,369,536401,22382,2010,12,3,11,lunch bag spaceboy design,2,2010-12-01 11:21:00,1.65,15862,United Kingdom,3.30
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Select all `lunch bag` orders made in 2011.

In [206]:
# your code here
lunch_bag_orders_2011 = lunch_bag_orders[lunch_bag_orders['year'] == 2011]
lunch_bag_orders_2011

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
26340,42678,540015,20725,2011,1,2,11,lunch bag red retrospot,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26341,42679,540015,20726,2011,1,2,11,lunch bag woodland,10,2011-01-04 11:40:00,1.65,13319,United Kingdom,16.50
26512,42851,540023,22382,2011,1,2,12,lunch bag spaceboy design,2,2011-01-04 12:58:00,1.65,15039,United Kingdom,3.30
26513,42852,540023,20726,2011,1,2,12,lunch bag woodland,1,2011-01-04 12:58:00,1.65,15039,United Kingdom,1.65
26860,43616,540098,22384,2011,1,2,15,lunch bag pink polkadot,1,2011-01-04 15:50:00,1.65,16241,United Kingdom,1.65
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397465,540436,581486,23207,2011,12,5,9,lunch bag alphabet design,10,2011-12-09 09:38:00,1.65,17001,United Kingdom,16.50
397713,541695,581538,20727,2011,12,5,11,lunch bag black skull.,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397714,541696,581538,20725,2011,12,5,11,lunch bag red retrospot,1,2011-12-09 11:34:00,1.65,14446,United Kingdom,1.65
397877,541862,581581,23681,2011,12,5,12,lunch bag red vintage doily,10,2011-12-09 12:20:00,1.65,17581,United Kingdom,16.50
397880,541865,581583,20725,2011,12,5,12,lunch bag red retrospot,40,2011-12-09 12:23:00,1.45,13777,United Kingdom,58.00

#### Show the frequency distribution of the amount spent in Spain.

In [208]:
# your code here

#### Select all orders made in the month of August.

In [210]:
# your code here
orders_august = orders[orders['month'] == 8]
orders_august

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
199475,285421,561904,22075,2011,8,1,8,6 ribbons elegant christmas,96,2011-08-01 08:30:00,1.45,17941,United Kingdom,139.20
199476,285422,561904,85049E,2011,8,1,8,scandinavian reds ribbons,156,2011-08-01 08:30:00,1.06,17941,United Kingdom,165.36
199477,285423,561905,21385,2011,8,1,9,ivory hanging decoration heart,24,2011-08-01 09:31:00,0.85,14947,United Kingdom,20.40
199478,285424,561905,84970L,2011,8,1,9,single heart zinc t-light holder,12,2011-08-01 09:31:00,0.95,14947,United Kingdom,11.40
199479,285425,561905,84970S,2011,8,1,9,hanging heart zinc t-light holder,12,2011-08-01 09:31:00,0.85,14947,United Kingdom,10.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
226483,320688,565067,22644,2011,8,3,17,ceramic cherry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226484,320689,565067,22645,2011,8,3,17,ceramic heart fairy cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226485,320690,565067,22637,2011,8,3,17,piggy bank retrospot,2,2011-08-31 17:16:00,2.55,15856,United Kingdom,5.10
226486,320691,565067,22646,2011,8,3,17,ceramic strawberry cake money bank,2,2011-08-31 17:16:00,1.45,15856,United Kingdom,2.90
226487,320692,565067,22741,2011,8,3,17,funky diva pen,48,2011-08-31 17:16:00,0.85,15856,United Kingdom,40.80

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [212]:
# your code here

order_count_by_country = orders_august['Country'].value_counts()

print("Number of orders made by each country in August:")
print(order_count_by_country)

Number of orders made by each country in August:
United Kingdom     23105
Germany              795
EIRE                 593
France               569
Netherlands          280
Switzerland          267
Spain                252
Belgium              194
Israel               171
Channel Islands      140
Australia            107
Italy                 95
Austria               88
Norway                77
Finland               61
Malta                 55
Portugal              41
Sweden                40
Unspecified           23
Iceland               22
Poland                17
Denmark               16
Canada                 5
Name: Country, dtype: int64

#### What's the  average amount of money spent by country?

In [221]:
# your code here
avg_spent_country = orders.groupby('Country')['amount_spent'].mean()
avg_spent_country

Country
Australia               116.895620
Austria                  25.624824
Bahrain                  32.258824
Belgium                  20.283772
Brazil                   35.737500
Canada                   24.280662
Channel Islands          27.340160
Cyprus                   22.134169
Czech Republic           33.069600
Denmark                  49.882474
EIRE                     36.687745
European Community       21.670833
Finland                  32.913985
France                   25.056827
Germany                  25.311562
Greece                   32.831172
Iceland                  23.681319
Israel                   29.119718
Italy                    23.064960
Japan                   116.561900
Lebanon                  37.641778
Lithuania                47.458857
Malta                    24.335625
Netherlands             120.798282
Norway                   33.736418
Poland                   22.226212
Portugal                 22.872702
RSA                      17.281207
Saudi Arabia             16.213333
Singapore                95.852658
Spain                    24.779521
Sweden                   85.096075
Switzerland              30.642752
USA                      20.002179
United Arab Emirates     27.974706
United Kingdom           20.625073
Unspecified              10.930615
Name: amount_spent, dtype: float64

#### What's the most expensive item?

In [237]:
# your code here

# most_expensive_item = orders['UnitPrice'].max()
# most_expensive_item_detail = orders[orders['UnitPrice'] == most_expensive_item]
# most_expensive_item_detail



# # Just to practice I will create a column only with the description and price of it.

# Find the maximum unit price
most_expensive_price = orders['UnitPrice'].max()

# Find the details of the most expensive item
most_expensive_item = orders[orders['UnitPrice'] == most_expensive_price][['Description', 'UnitPrice']]

print(most_expensive_item)

       Description  UnitPrice
118352     postage    8142.75

#### What is the average amount spent per year?

In [246]:
# your code here
avg_spent_per_year = orders.groupby('year')['amount_spent'].mean()
avg_spent_per_year

year
2010    21.892733
2011    22.430074
Name: amount_spent, dtype: float64